{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_71","layers":[{"class_name":"Dense","config":{"units":5,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.05}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense141","trainable":true,"batch_input_shape":[null,12],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.025,"noise_shape":null,"seed":null,"name":"dropout_Dropout71","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense142","trainable":true}}]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense141/kernel","shape":[12,5],"dtype":"float32"},{"name":"dense_Dense141/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense142/kernel","shape":[5,1],"dtype":"float32"},{"name":"dense_Dense142/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null}